# Assessment 1

1. Questions: https://github.com/a-forty-two/COG_GN22CDBDS001_MARCH_22/blob/main/Assessment1.ipynb
2. Dataset: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

# Step 1: Import the necessary libraries

In [1]:
import pandas as pd

# Step 2: Import the data from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user)

# Step 3: Asssign it to the variable called users and use the 'user_id' as index

In [2]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
users = users.set_index('user_id')

# Step 4: See the first 25 entries

In [3]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

# Step 5: See the last 10 entries

In [4]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# Step 6: What is the number of observations in the dataset

In [5]:
print(len(users.index))

943

# Step 7: What is the number of columns in the dataset

In [6]:
print(len(users.columns))

4

# Step 8: Print the name of all the columns

In [7]:
print(list(users.columns))

['age', 'gender', 'occupation', 'zip_code']

# Step 9: How is the dataset indexed?

Dataset is indexed by the user_id column

# Step 10: What is the datatype of each column?

In [8]:
types = users.dtypes
keys = types.keys()
for key in keys:
    print(f"The datatype of the column '{key}' is '{types[key]}'")

The datatype of the column 'age' is 'int64'
The datatype of the column 'gender' is 'object'
The datatype of the column 'occupation' is 'object'
The datatype of the column 'zip_code' is 'object'

# Step 11: Print only the occupation column

In [9]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# Step 12: How many different occupations are in this dataset?

In [10]:
print(len(users['occupation'].unique()))

21

# Step 13: What is the most frequent occupation?

In [11]:
users['occupation'].value_counts().sort_values(ascending=False).keys()[0]

'student'

# Step 14: Summarize the dataframe

In [12]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# Step 15: Summarize all the columns

In [13]:
for column in users.columns:
    print(f"Summary for column {column}")
    print(users[column].describe())
    print()

Summary for column age
count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

Summary for column gender
count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

Summary for column occupation
count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

Summary for column zip_code
count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object

# Step 16: Summarize only the occupation column

In [14]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# Step 17: What is the mean age of users?

In [15]:
users['age'].mean()

34.05196182396607

# Step 18: What is the age with the least occurence?

In [16]:
users['age'].value_counts().sort_values().keys()[0]

73

# Step 19: Write a lambda function to convert a string column to a numerical column

In [17]:
str_to_int = lambda x : int(x)

fancy_str_to_int = lambda x : int(x) if (type(x) is int) else None